#Titanic Dataset

La tarea de esta semana consiste en preprocesar el dataset del Titanic, puede consultar la imagen "Diccionario de datos" para mayor detalle sobre los atributos utilizados

In [0]:
import pandas as pd
import numpy as np

###1. Importar el archivo "titanic-data.csv" con la librer√≠a pandas y mostrar los 5 primeros datos

In [259]:
data = pd.read_csv("titanic-data.csv")
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

###2. Revise cuantos datos faltantes existen en el dataset

In [260]:
#Funcion .isnull( )
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

###3. Completando las edades faltantes:

####3a. Los datos de la columna "Age" que no contienen datos los completaremos con -0.5

In [0]:
#Funcion .fillna( )
data['Age'] = data['Age'].fillna(-0.5)

####3b. Clasificaremos las edades en los siguientes intervalos:

Unknown: -1 - 0

Baby: 0 - 5

Child: 5 - 12

Teenager: 12 - 18

Student: 18 - 25

Young Adult: 25 - 35

Adult: 35 - 60

Senior: 60 - 120

In [0]:
bins = (-1, 0, 5, 12, 18, 25, 35, 60, 120)
group_names = ['Unknown', 'Baby', 'Child', 'Teenager', 'Student', 'Young Adult', 'Adult', 'Senior']
categories = pd.cut(data['Age'], bins, labels=group_names)
data['Edad'] = categories

####3c. Eliminamos la columna "Age", los datos ya no son necesarios

In [0]:
del data['Age']

###4. Simplificando las tarifas (Fare):

####4a. Al no contar con una clasificaci√≥n determinada para la columna "Fare", utilizaremos los intervalos que nos proporciona los cuartiles. ¬øC√∫ales son esos intervalos?

In [264]:
data['Fare'].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

####4b. Ahora que tenemos los intervalos, clasificaremos la data "Fare", utilice nombres a su criterio

In [0]:
bins = (0, 8, 15, 31, 513)
group_names = ['1_quartile', '2_quartile', '3_quartile', '4_quartile']
categories = pd.cut(data['Fare'], bins, labels=group_names,include_lowest=True)
data['Tarifa'] = categories

####4c. La columna "Fare" ya no es necesaria

In [0]:
del data['Fare']

###5. Dando formato a "Name"

####5a. En la columna "Name" solo es necesario el apellido y el prefijo que acompa√±a el nombre (Mr.)

Ejecutaremos el siguiente c√≥digo para crear nuevas columnas con esa informaci√≥n:

In [0]:
#Reemplazar "data" por el nombre de su dataset
apellido = data['Name'].apply(lambda x: x.split(',')[0])
data['Lname'] = apellido

.apply( ) -> Funci√≥n de Pandas que ejecuta una funci√≥n por cada elemento, en este caso por cada elemento de la columna "Name"

lambda -> Crea una funci√≥n de una l√≠nea con la variable x

x.split('  ') -> Corta un texto con el caracter entre par√©ntesis

Ejecutando el c√≥digo en una linea:

[Braund,  Mr. Owen Harris]

Se crea una lista, se selecciona lo que queremos en este caso el apellido se encuentra en la primera posici√≥n, por ese motivo colocamos [0]

In [0]:
nombre = data['Name'].apply(lambda x: x.split(',')[1])
titulo = nombre.apply(lambda x: x.split('.')[0])
data['NamePrefix'] = titulo

In [269]:
data['NamePrefix'].value_counts()

 Mr              517
 Miss            182
 Mrs             125
 Master           40
 Dr                7
 Rev               6
 Col               2
 Mlle              2
 Major             2
 Capt              1
 Don               1
 Lady              1
 Sir               1
 Jonkheer          1
 the Countess      1
 Ms                1
 Mme               1
Name: NamePrefix, dtype: int64

####5b. La columna "Name" ya no es necesaria

In [0]:
del data['Name']

###6. Completando datos faltantes en "Embarked"

Como hemos visto al comienzo del cuaderno, son 2 los datos faltantes en la columna "Embarked", como son letras no podemos llenarlo con la media, para eso completaremos estos datos con la letra que tenga mayor n√∫mero de datos

####6a. Halle la letra que tiene m√°s valores en la columna "Embarked"

In [271]:
data['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

####6b. Complete los datos faltantes con la letra hallada en la pregunta anterior

In [0]:
data['Embarked'] = data['Embarked'].fillna('S')

###7. ¬øDeberian considerarse todos los campos del dataset para analizar la informaci√≥n posteriormente? Justifique

####8. Seg√∫n lo respondido en la pregunta anterior: Elimine las columnas de los datos que no ser√°n relevantes para nuestro an√°lisis

In [273]:
data.head()

   PassengerId  Survived  Pclass  ...      Tarifa      Lname  NamePrefix
0            1         0       3  ...  1_quartile     Braund          Mr
1            2         1       1  ...  4_quartile    Cumings         Mrs
2            3         1       3  ...  1_quartile  Heikkinen        Miss
3            4         1       1  ...  4_quartile   Futrelle         Mrs
4            5         0       3  ...  2_quartile      Allen          Mr

[5 rows x 13 columns]

In [0]:
del data['PassengerId']
del data['Ticket']
del data['Cabin']

In [275]:
data.head()

   Survived  Pclass     Sex  ...      Tarifa      Lname NamePrefix
0         0       3    male  ...  1_quartile     Braund         Mr
1         1       1  female  ...  4_quartile    Cumings        Mrs
2         1       3  female  ...  1_quartile  Heikkinen       Miss
3         1       1  female  ...  4_quartile   Futrelle        Mrs
4         0       3    male  ...  2_quartile      Allen         Mr

[5 rows x 10 columns]

**Con esto nuestra data estar√≠a limpia y lista para el an√°lisis**

#Label Encoding

Codifica las etiquetas de destino con un valor entre 0 y n_classes-1.

###Mapear 'Sex'

In [0]:
from sklearn import preprocessing

In [0]:
le = preprocessing.LabelEncoder() 
le = le.fit(data['Sex'])
data['Sex'] = le.transform(data['Sex'])

In [278]:
data['Sex'].value_counts()

1    577
0    314
Name: Sex, dtype: int64

In [279]:
data.head()

   Survived  Pclass  Sex  SibSp  ...         Edad      Tarifa      Lname NamePrefix
0         0       3    1      1  ...      Student  1_quartile     Braund         Mr
1         1       1    0      1  ...        Adult  4_quartile    Cumings        Mrs
2         1       3    0      0  ...  Young Adult  1_quartile  Heikkinen       Miss
3         1       1    0      1  ...  Young Adult  4_quartile   Futrelle        Mrs
4         0       3    1      0  ...  Young Adult  2_quartile      Allen         Mr

[5 rows x 10 columns]

###Invertir Transformaci√≥n

In [0]:
data['Sex'] = le.inverse_transform(data['Sex'])

In [281]:
data.head()

   Survived  Pclass     Sex  ...      Tarifa      Lname NamePrefix
0         0       3    male  ...  1_quartile     Braund         Mr
1         1       1  female  ...  4_quartile    Cumings        Mrs
2         1       3  female  ...  1_quartile  Heikkinen       Miss
3         1       1  female  ...  4_quartile   Futrelle        Mrs
4         0       3    male  ...  2_quartile      Allen         Mr

[5 rows x 10 columns]

###Diccionario de Mapeado

In [282]:
le_name_mapping = dict(zip(le.classes_, le.transform(le.classes_)))
print(le_name_mapping)

{'female': 0, 'male': 1}

###Mapeado de Edad

In [0]:
lEdad = preprocessing.LabelEncoder() 
lEdad = lEdad.fit(data['Edad'])
data['Edad'] = lEdad.transform(data['Edad'])

In [284]:
data['Edad'].value_counts()

7    196
0    195
6    177
4    162
5     70
1     44
2     25
3     22
Name: Edad, dtype: int64

In [285]:
data.head()

   Survived  Pclass     Sex  SibSp  ...  Edad      Tarifa      Lname NamePrefix
0         0       3    male      1  ...     4  1_quartile     Braund         Mr
1         1       1  female      1  ...     0  4_quartile    Cumings        Mrs
2         1       3  female      0  ...     7  1_quartile  Heikkinen       Miss
3         1       1  female      1  ...     7  4_quartile   Futrelle        Mrs
4         0       3    male      0  ...     7  2_quartile      Allen         Mr

[5 rows x 10 columns]

In [286]:
Edad_Mapeado = dict(zip(lEdad.classes_, lEdad.transform(lEdad.classes_)))
print(Edad_Mapeado)

{'Adult': 0, 'Baby': 1, 'Child': 2, 'Senior': 3, 'Student': 4, 'Teenager': 5, 'Unknown': 6, 'Young Adult': 7}

###Guardando CSV

In [0]:
data.to_csv("modificado.csv",index = False)

In [304]:
data2 = pd.read_csv("modificado.csv")
data2.head()

   Survived  Pclass  Sex  SibSp  ...  Edad  Tarifa  Lname  NamePrefix
0         0       3    1      1  ...     4       0     73          11
1         1       1    0      1  ...     0       3    136          12
2         1       3    0      0  ...     7       0    251           8
3         1       1    0      1  ...     7       3    198          12
4         0       3    1      0  ...     7       1     11          11

[5 rows x 10 columns]

#Ejercicios

###¬øCu√°ntas hombres y mujeres hay?

In [0]:
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

###¬øCu√°ntas personas de la clase 1 sobrevivieron?

In [0]:
data[(data['Pclass']==1 & (data['Survived']==1))].shape[0]

136

###¬øC√∫al es la familia m√°s numerosa que abord√≥ el titanic?

In [0]:
data['Lname'].value_counts()

Andersson     9
Sage          7
Carter        6
Panula        6
Skoog         6
             ..
Lewy          1
Moutal        1
Willey        1
Augustsson    1
Cherry        1
Name: Lname, Length: 667, dtype: int64

###¬øC√∫antos Child de la clase 3 sobrevivieron?

In [0]:
data[(data['Edad']=='Child') & (data['Pclass']==3) & (data['Survived']==1)]

     Survived  Pclass   Sex  SibSp  ...   Edad      Tarifa          Lname NamePrefix
125         1       3  male      1  ...  Child  2_quartile  Nicola-Yarred     Master
165         1       3  male      0  ...  Child  3_quartile      Goldsmith     Master
489         1       3  male      1  ...  Child  3_quartile         Coutts     Master
751         1       3  male      0  ...  Child  2_quartile           Moor     Master

[4 rows x 10 columns]

###¬øC√∫al es el cuartil de Tarifa que tuvo m√°s sobrevivientes?

In [0]:
data[data['Survived']==1]['Tarifa'].value_counts()

4_quartile    129
3_quartile     99
2_quartile     62
1_quartile     51
Name: Tarifa, dtype: int64